## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_lambda_function_url.url_shortener_url`            |
|        | `module.url_shortener_lambda.aws_lambda_function.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function_url.url_shortener_url will be created
  + resource "aws_lambda_function_url" "url_shortener_url" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "url-shortener-api"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)
    }

  # module.url_shortener_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "url-shortener-api"
      + id                             = (known after apply)
      + image_uri                      = "843973686572.dkr.ecr.ca-central-1.amazonaws.com/url-shortener/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::843973686572:role/url-shortener-api"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_AUTH_TOKEN_SECRET_ARN" = "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token"
              + "DOMAIN"                    = "url-shortener.cdssandbox.xyz"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-05b0e1a639a72c169",
            ]
          + subnet_ids         = [
              + "subnet-07ff4842f92d4b21c",
              + "subnet-0928680740ec26bf3",
              + "subnet-0a0ccd2346ca16b7b",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + function_arn = (known after apply)
  + function_url = (known after apply)
  + invoke_arn   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
